spec/support/vcr_cassettes/mpi/find_candidate/find_profile_with_attributes.yml

---
http_interactions:
- request:
    method: post
    uri: http://example.com/
    body:
      encoding: ASCII-8BIT
      base64_string:
        CjxlbnY6RW52ZWxvcGUgeG1sbnM6c29hcGVuYz0iaHR0cDovL3NjaGVtYXMu
        eG1sc29hcC5vcmcvc29hcC9lbmNvZGluZy8iIHhtbG5zOnhzZD0iaHR0cDov
        L3d3dy53My5vcmcvMjAwMS9YTUxTY2hlbWEiIHhtbG5zOmVudj0iaHR0cDov
        L3NjaGVtYXMueG1sc29hcC5vcmcvc29hcC9lbnZlbG9wZS8iIHhtbG5zOnhz
        aT0iaHR0cDovL3d3dy53My5vcmcvMjAwMS9YTUxTY2hlbWEtaW5zdGFuY2Ui
        PgogIDxlbnY6SGVhZGVyLz4KICA8ZW52OkJvZHk+CiAgICA8aWRtOlBSUEFf
        SU4yMDEzMDVVVjAyIHhtbG5zOmlkbT0iaHR0cDovL3Zhd3cub2VkLm9pdC52
        YS5nb3YiIHhtbG5zOnhzaT0iaHR0cDovL3d3dy53My5vcmcvMjAwMS9YTUxT
        Y2hlbWHigJBpbnN0YW5jZSIgeHNpOnNjaGVtYUxvY2F0aW9uPSJ1cm46aGw3
        4oCQb3JnOnYzIC4uLy4uL3NjaGVtYS9ITDdWMy9ORTIwMDgvbXVsdGljYWNo
        ZXNjaGVtYXMvUFJQQV9JTjIwMTMwNVVWMDIueHNkIiB4bWxucz0idXJuOmhs
        N+KAkG9yZzp2MyIgSVRTVmVyc2lvbj0iWE1MXzEuMCI+CiAgICAgIDxpZCBy
        b290PSIxLjIuODQwLjExNDM1MC4xLjEzLjAuMS43LjEuMSIgZXh0ZW5zaW9u
        PSIyMDBWR09WLWMzZmEwNzY5LTcwY2ItNDE5YS1iM2E2LWQyNTYzZTdiODUw
        MiIvPgogICAgICA8Y3JlYXRpb25UaW1lIHZhbHVlPSIyMDE5MDgyOTE3NDUw
        MyIvPgogICAgICA8dmVyc2lvbkNvZGUgY29kZT0iNC4xIi8+CiAgICAgIDxp
        bnRlcmFjdGlvbklkIHJvb3Q9IjIuMTYuODQwLjEuMTEzODgzLjEuNiIgZXh0
        ZW5zaW9uPSJQUlBBX0lOMjAxMzA1VVYwMiIvPgogICAgICA8cHJvY2Vzc2lu
        Z0NvZGUgY29kZT0iVCIvPgogICAgICA8cHJvY2Vzc2luZ01vZGVDb2RlIGNv
        ZGU9IlQiLz4KICAgICAgPGFjY2VwdEFja0NvZGUgY29kZT0iQUwiLz4KICAg
        ICAgPHJlY2VpdmVyIHR5cGVDb2RlPSJSQ1YiPgogICAgICAgIDxkZXZpY2Ug
        Y2xhc3NDb2RlPSJERVYiIGRldGVybWluZXJDb2RlPSJJTlNUQU5DRSI+CiAg
        ICAgICAgICA8aWQgcm9vdD0iMS4yLjg0MC4xMTQzNTAuMS4xMy45OTkuMjM0
        IiBleHRlbnNpb249IjIwME0iLz4KICAgICAgICA8L2RldmljZT4KICAgICAg
        PC9yZWNlaXZlcj4KICAgICAgPHNlbmRlciB0eXBlQ29kZT0iU05EIj4KICAg
        ICAgICA8ZGV2aWNlIGNsYXNzQ29kZT0iREVWIiBkZXRlcm1pbmVyQ29kZT0i
        SU5TVEFOQ0UiPgogICAgICAgICAgPGlkIHJvb3Q9IjIuMTYuODQwLjEuMTEz
        ODgzLjQuMzQ5IiBleHRlbnNpb249IjIwMFZHT1YiLz4KICAgICAgICA8L2Rl
        dmljZT4KICAgICAgPC9zZW5kZXI+CiAgICAgIDxjb250cm9sQWN0UHJvY2Vz
        cyBjbGFzc0NvZGU9IkNBQ1QiIG1vb2RDb2RlPSJFVk4iPgogICAgICAgIDxj
        b2RlIGNvZGU9IlBSUEFfVEUyMDEzMDVVVjAyIiBjb2RlU3lzdGVtPSIyLjE2
        Ljg0MC4xLjExMzg4My4xLjYiLz4KICAgICAgICA8ZGF0YUVudGVyZXIgdHlw
        ZUNvZGU9IkVOVCIgY29udGV4dENvbnRyb2xDb2RlPSJBUCI+CiAgICAgICAg
        ICA8YXNzaWduZWRQZXJzb24gY2xhc3NDb2RlPSJBU1NJR05FRCI+CiAgICAg
        ICAgICAgIDxpZCBleHRlbnNpb249Ijc5NjA0MzczNSIgcm9vdD0iMi4xNi44
        NDAuMS4xMTM4ODMuNzc3Ljk5OSIvPgogICAgICAgICAgICA8YXNzaWduZWRQ
        ZXJzb24gY2xhc3NDb2RlPSJQU04iIGRldGVybWluZXJDb2RlPSJJTlNUQU5D
        RSI+CiAgICAgICAgICAgICAgPG5hbWU+CiAgICAgICAgICAgICAgICA8Z2l2
        ZW4+V0VTTEVZPC9naXZlbj4KICAgICAgICAgICAgICAgIDxmYW1pbHk+Rk9S
        RDwvZmFtaWx5PgogICAgICAgICAgICAgIDwvbmFtZT4KICAgICAgICAgICAg
        PC9hc3NpZ25lZFBlcnNvbj4KICAgICAgICAgIDwvYXNzaWduZWRQZXJzb24+
        CiAgICAgICAgPC9kYXRhRW50ZXJlcj4KICAgICAgICA8cXVlcnlCeVBhcmFt
        ZXRlcj4KICAgICAgICAgIDxxdWVyeUlkIHJvb3Q9IjEuMi44NDAuMTE0MzUw
        LjEuMTMuMjguMS4xOC41Ljk5OSIgZXh0ZW5zaW9uPSIxODIwNCIvPgogICAg
        ICAgICAgPHN0YXR1c0NvZGUgY29kZT0ibmV3Ii8+CiAgICAgICAgICA8bW9k
        aWZ5Q29kZSBjb2RlPSJNVkkuQ09NUDEuUk1TIi8+CiAgICAgICAgICA8aW5p
        dGlhbFF1YW50aXR5IHZhbHVlPSIxIi8+CiAgICAgICAgICA8cGFyYW1ldGVy
        TGlzdD4KICAgICAgICAgICAgPGxpdmluZ1N1YmplY3RCaXJ0aFRpbWU+CiAg
        ICAgICAgICAgICAgPHZhbHVlIHZhbHVlPSIxOTg2MDUwNiIvPgogICAgICAg
        ICAgICAgIDxzZW1hbnRpY3NUZXh0PkRhdGUgb2YgQmlydGg8L3NlbWFudGlj
        c1RleHQ+CiAgICAgICAgICAgIDwvbGl2aW5nU3ViamVjdEJpcnRoVGltZT4K
        ICAgICAgICAgICAgPGxpdmluZ1N1YmplY3RJZD4KICAgICAgICAgICAgICA8
        dmFsdWUgcm9vdD0iMi4xNi44NDAuMS4xMTM4ODMuNC4xIiBleHRlbnNpb249
        Ijc5NjA0MzczNSIvPgogICAgICAgICAgICAgIDxzZW1hbnRpY3NUZXh0PlNT
        Tjwvc2VtYW50aWNzVGV4dD4KICAgICAgICAgICAgPC9saXZpbmdTdWJqZWN0
        SWQ+CiAgICAgICAgICAgIDxsaXZpbmdTdWJqZWN0TmFtZT4KICAgICAgICAg
        ICAgICA8dmFsdWUgdXNlPSJMIj4KICAgICAgICAgICAgICAgIDxnaXZlbj5X
        RVNMRVk8L2dpdmVuPgogICAgICAgICAgICAgICAgPGZhbWlseT5GT1JEPC9m
        YW1pbHk+CiAgICAgICAgICAgICAgPC92YWx1ZT4KICAgICAgICAgICAgICA8
        c2VtYW50aWNzVGV4dD5MZWdhbCBOYW1lPC9zZW1hbnRpY3NUZXh0PgogICAg
        ICAgICAgICA8L2xpdmluZ1N1YmplY3ROYW1lPgogICAgICAgICAgPC9wYXJh
        bWV0ZXJMaXN0PgogICAgICAgIDwvcXVlcnlCeVBhcmFtZXRlcj4KICAgICAg
        PC9jb250cm9sQWN0UHJvY2Vzcz4KICAgIDwvaWRtOlBSUEFfSU4yMDEzMDVV
        VjAyPgogIDwvZW52OkJvZHk+CjwvZW52OkVudmVsb3BlPgo=
    headers:
      Accept:
      - text/xml;charset=UTF-8
      Content-Type:
      - text/xml;charset=UTF-8
      User-Agent:
      - Vets.gov Agent
      Soapaction:
      - PRPA_IN201305UV02
      Date:
      - Thu, 29 Aug 2019 17:45:03 GMT
      Content-Length:
      - '2870'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      X-Backside-Transport:
      - OK OK,OK OK
      Connection:
      - Keep-Alive
      Transfer-Encoding:
      - chunked
      Date:
      - Thu, 29 Aug 2019 17:45:03 GMT
      Content-Type:
      - text/xml
      Set-Cookie:
      - JSESSIONID=MPjeexNdIL5CT2-9GcRkt27Ng38S3yz-Q4UVaSbF5iBFpyTP1bbN!1479690723;
        path=/; HttpOnly
      X-Global-Transaction-Id:
      - f8ba53155d680f1e01d9c2a0
    body:
      encoding: UTF-8
      string:
        <?xml version="1.0" encoding="UTF-8"?>
        <env:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
          xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"
          xmlns:xsd="http://www.w3.org/2001/XMLSchema"
          xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
          <env:Header/>
          <env:Body>
            <idm:PRPA_IN201306UV02 ITSVersion="XML_1.0" xsi:schemaLocation="urn:hl7-org:v3 ../../schema/HL7V3/NE2008/multicacheschemas/PRPA_IN201306UV02.xsd"
              xmlns:idm="http://vaww.oed.oit.va.gov"
              xmlns="urn:hl7-org:v3">
              <id extension="WSDOC1908291345035821626418148" root="2.16.840.1.113883.4.349"/>
              <creationTime value="20190829134503"/>
              <versionCode code="4.1"/>
              <interactionId extension="PRPA_IN201306UV02" root="2.16.840.1.113883.1.6"/>
              <processingCode code="T"/>
              <processingModeCode code="T"/>
              <acceptAckCode code="NE"/>
              <receiver typeCode="RCV">
                <device determinerCode="INSTANCE" classCode="DEV">
                  <id extension="200VGOV" root="2.16.840.1.113883.4.349"/>
                </device>
              </receiver>
              <sender typeCode="SND">
                <device determinerCode="INSTANCE" classCode="DEV">
                  <id extension="200M" root="2.16.840.1.113883.4.349"/>
                </device>
              </sender>
              <acknowledgement>
                <typeCode code="AA"/>
                <targetMessage>
                  <id extension="200VGOV-c3fa0769-70cb-419a-b3a6-d2563e7b8502" root="1.2.840.114350.1.13.0.1.7.1.1"/>
                </targetMessage>
                <acknowledgementDetail>
                  <code codeSystemName="MVI" code="130" displayName="IMT"/>
                  <text>Identity Match Threshold</text>
                </acknowledgementDetail>
                <acknowledgementDetail>
                  <code codeSystemName="MVI" code="103" displayName="PDT"/>
                  <text>Potential Duplicate Threshold</text>
                </acknowledgementDetail>
              </acknowledgement>
              <controlActProcess classCode="CACT" moodCode="EVN">
                <code codeSystem="2.16.840.1.113883.1.6" code="PRPA_TE201306UV02"/>
                <subject typeCode="SUBJ">
                  <registrationEvent classCode="REG" moodCode="EVN">
                    <id nullFlavor="NA"/>
                    <statusCode code="active"/>
                    <subject1 typeCode="SBJ">
                      <patient classCode="PAT">
                        <id extension="1012832025V743496^NI^200M^USVHA^P" root="2.16.840.1.113883.4.349"/>
                        <id extension="1007697216^NI^200DOD^USDOD^A" root="2.16.840.1.113883.3.42.10001.100001.12"/>
                        <id extension="796043735^PI^200BRLS^USVBA^A" root="2.16.840.1.113883.4.349"/>
                        <id extension="600061742^PI^200CORP^USVBA^A" root="2.16.840.1.113883.4.349"/>
                        <id extension="0000027892^PN^200PROV^USDVA^A" root="2.16.840.1.113883.4.349"/>
                        <id extension="7217514^PI^983^USVHA^A" root="2.16.840.1.113883.4.349"/>
                        <id extension="0000001012832025V743496000000^PI^200ESR^USVHA^A" root="2.16.840.1.113883.4.349"/>
                        <id extension="1273780^PI^200VETS^USDVA^A" root="2.16.840.1.113883.4.349"/>
                        <id extension="ec8be01aa8d744979ff6df40ff2037bf^PN^200VIDM^USDVA^A" root="2.16.840.1.113883.4.349"/>
                        <statusCode code="active"/>
                        <patientPerson>
                          <name use="L">
                            <given>WESLEY</given>
                            <given>WATSON</given>
                            <family>FORD</family>
                          </name>
                          <name use="C">
                            <family>THOMSON</family>
                          </name>
                          <telecom value="(477)490-5565" use="HP"/>
                          <administrativeGenderCode code="M"/>
                          <birthTime value="19860506"/>
                          <deceasedInd nullFlavor="TRC" value="false"/>
                          <multipleBirthInd value="false"/>
                          <addr use="PHYS">
                            <streetAddressLine>2610 S ONG ST</streetAddressLine>
                            <city>AMARILLO</city>
                            <state>TX</state>
                            <postalCode>79109-2335</postalCode>
                            <country>USA</country>
                          </addr>
                          <asOtherIDs classCode="SSN">
                            <id extension="796043735" root="2.16.840.1.113883.4.1"/>
                            <scopingOrganization determinerCode="INSTANCE" classCode="ORG">
                              <id root="1.2.840.114350.1.13.99997.2.3412"/>
                            </scopingOrganization>
                          </asOtherIDs>
                          <birthPlace>
                            <addr>
                              <city>SALINA</city>
                              <state>KS</state>
                              <country>USA</country>
                            </addr>
                          </birthPlace>
                        </patientPerson>
                        <subjectOf1>
                          <queryMatchObservation classCode="COND" moodCode="EVN">
                            <code code="IHE_PDQ"/>
                            <value value="165" xsi:type="INT"/>
                          </queryMatchObservation>
                        </subjectOf1>
                        <subjectOf2 typeCode="SBJ">
                          <administrativeObservation classCode="VERIF">
                            <code codeSystem="2.16.840.1.113883.4.349" code="PERSON_TYPE" displayName="Person Type"/>
                            <value xsi:type="CD" code="PAT" displayName="Patient"/>
                          </administrativeObservation>
                        </subjectOf2>
                      </patient>
                    </subject1>
                    <custodian typeCode="CST">
                      <assignedEntity classCode="ASSIGNED">
                        <id root="2.16.840.1.113883.4.349"/>
                      </assignedEntity>
                    </custodian>
                  </registrationEvent>
                </subject>
                <queryAck>
                  <queryId extension="18204" root="1.2.840.114350.1.13.28.1.18.5.999"/>
                  <queryResponseCode code="OK"/>
                  <resultCurrentQuantity value="1"/>
                </queryAck>
                <queryByParameter>
                  <queryId extension="18204" root="1.2.840.114350.1.13.28.1.18.5.999"/>
                  <statusCode code="new"/>
                  <modifyCode code="MVI.COMP1.RMS"/>
                  <initialQuantity value="1"/>
                  <parameterList>
                    <livingSubjectBirthTime>
                      <value value="19860506"/>
                      <semanticsText>Date of Birth</semanticsText>
                    </livingSubjectBirthTime>
                    <livingSubjectId>
                      <value extension="796043735" root="2.16.840.1.113883.4.1"/>
                      <semanticsText>SSN</semanticsText>
                    </livingSubjectId>
                    <livingSubjectName>
                      <value use="L">
                        <given>WESLEY</given>
                        <family>FORD</family>
                      </value>
                      <semanticsText>Legal Name</semanticsText>
                    </livingSubjectName>
                  </parameterList>
                </queryByParameter>
              </controlActProcess>
            </idm:PRPA_IN201306UV02>
          </env:Body>
        </env:Envelope>
    http_version:
  recorded_at: Thu, 29 Aug 2019 17:45:04 GMT
recorded_with: VCR 3.0.3
